init.org
# ------------------------------------------------------------------------------
#+TITLE:     My Emacs's Configuration
#+SUBTITLE:  Kebairia Zakaria - January 2021
#+AUTHOR:    Kebairia Zakaria
#+EMAIL:     4.kebairia@gmail.com
#+LANGUAGE:  en
#+STARTUP:   content showstars indent inlineimages hideblocks
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/zakaria/org/conf/rouger.css" />
#+OPTIONS:   toc:2 html-scripts:nil num:nil html-postamble:nil html-style:nil ^:nil
#+PROPERTY:  header-args :results none
#+ARCHIVE: ~/org/config_archive.org::
# ------------------------------------------------------------------------------
- automatically tangle our ~init.org~ config file when we save it
#+begin_src emacs-lisp
  (defun zk/org-babel-tangle-config()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.config/emacs/init.org"))
      ;; dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
      (add-hook 'org-mode-hook (lambda ()(add-hook 'after-save-hook #'zk/org-babel-tangle-config))) 
#+end_src
* BOOTSTRAP
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/init.el
:header-args: :results none
:END:
** DEPS
#+begin_src emacs-lisp
  ;;; package --- Summary  
  ;; Load configuration from ~/.config/emacs/modules/*.el

                ;;; Commentary:
  ;; Added by Package.el.  This must come before configurations of
  ;; installed packages.  Don't delete this line.  If you don't want it,
  ;; just comment it out by adding a semicolon to the start of the line.
  ;; You may delete these explanatory comments.

#+end_src
- ~gc-cons-threshold~ is the number of bytes of consing before a garbage collection is invoked.
  It's normally set at 800,000 bytes, but for me that invokes the GC 39 times!!! during startup ~(gcs-done)~ ,
  and the GC is sloooow. I've set it to ~384M above.
  And now no GC invocations during startup.
  source:  [[https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/][2 easy little known steps to speed up Emacs start up time]]
- reset the ~gc-cons-threshold~ to its defaults values after startup
*** Faster Startup 
#+begin_src emacs-lisp
  ;; Speed up startup
  (setq gc-cons-threshold 402653184
        gc-cons-percentage 0.6)
  (add-hook 'after-init-hook
            `(lambda ()
               (setq gc-cons-threshold 800000
                     gc-cons-percentage 0.1)
               (garbage-collect)) t)
#+end_src
*** Load files and initialize packages repositories
#+begin_src emacs-lisp
  ;; package managers
  (require 'package)
  ;;(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
  ;; emacs 27 now does'nt need a package-initialize
  (when (< emacs-major-version 27)
    (package-initialize))
  ;; load files
  (load "~/.config/emacs/modules/DEFAULTS.el") 
  (load "~/.config/emacs/modules/PACKAGES.el") 
  (load "~/.config/emacs/modules/SESSIONS.el") 
  (load "~/.config/emacs/modules/BINDINGS.el") 
  (load "~/.config/emacs/modules/ORG.el") 
  (load "~/.config/emacs/modules/MU4E.el") 
  (load "~/.config/emacs/nano/nano.el") 
  (load "~/.config/emacs/nano/nano-layout.el") 
  (load "~/.config/emacs/nano/nano-modeline.el") 
#+end_src
*** Mesure emacs startup time
#+begin_src emacs-lisp
  ;; Measure emacs startup time
  (add-to-list 'after-init-hook
               (lambda ()
                 (message (concat "emacs ("
                                  (number-to-string (emacs-pid))
                                  ") started in "
                                  (emacs-init-time)))))
#+end_src
** DEFAULTS
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/modules/DEFAULTS.el
:header-args: :results none
:END:
#+begin_src emacs-lisp
  ;; User name
  (setq user-full-name "Kebairia Zakaria")
  ;; User mail address
  (setq user-mail-address "4.kebairia@gmail.com")
  ;; No startup  screen
  (setq inhibit-startup-screen t)
  ;; No startup message
  (setq inhibit-startup-message t)
  (setq inhibit-startup-echo-area-message t)
  ;; No message in scratch buffer
  (setq initial-scratch-message nil)
  ;; Initial buffer 
  (setq initial-buffer-choice nil)
  ;; No frame title
  (setq frame-title-format nil)
  ;; No file fialog
  (setq use-file-dialog nil)
  ;; No dialog box
  (setq use-dialog-box nil)
  ;; No popup windows
  (setq pop-up-windows nil)
  ;; No empty line indicators
  (setq indicate-empty-lines nil)
  ;; No cursor in inactive windows
  (setq cursor-in-non-selected-windows nil)
  ;; fundamental mode is initial mode
  ;;(setq initial-major-mode 'fundamental-mode)
  ;; Text mode is default major mode
  ;;(setq default-major-mode 'text-mode)
  ;; Moderate font lock
  (setq font-lock-maximum-decoration nil)
  ;; No limite on font lock
  (setq font-lock-maximum-size nil)

  ;; No line breat space points
  (setq auto-fill-mode nil)

  ;; Fill column at 80
  (setq fill-column 80)

  ;; No confirmation for visiting non-existent files
  (setq confirm-nonexistent-file-or-buffer nil)

  ;; Completion style, see
  ;; gnu.org/software/emacs/manual/html_node/emacs/Completion-Styles.html
  (setq completion-styles '(basic substring))

  ;; Mouse active in terminal
  (unless (display-graphic-p)
    (xterm-mouse-mode 1)
    (global-set-key (kbd "<mouse-4>") 'scroll-down-line)
    (global-set-key (kbd "<mouse-5>") 'scroll-up-line))
  ;; modeline at top
  (setq-default header-line-format mode-line-format)
  ;; No scroll bars
  (scroll-bar-mode 0)
  ;; No toolbar
  (tool-bar-mode 0)
  ;; No menu bar
  (menu-bar-mode -1)
  ;; (if (display-graphic-p)
  ;;     (menu-bar-mode t) ;; When nil, focus problem on OSX
  ;;   (menu-bar-mode -1))
  ;; Navigate windows using shift+direction
  (windmove-default-keybindings)
  ;; Paren mode
  (show-paren-mode 1)
  ;; Electric pair mode
  (electric-pair-mode 1)
  ;; Tab behavior
  (setq tab-always-indent 'complete)
  (global-company-mode)
  (define-key company-mode-map [remap indent-for-tab-command]
    #'company-indent-or-complete-common)
  ;; Pixel scroll (as opposed to char scrool)
  (pixel-scroll-mode t)
  ;; Mac specific
  ;; (setq ns-use-native-fullscreen t
  ;;       mac-option-key-is-meta nil
  ;;       mac-command-key-is-meta t
  ;;       mac-command-modifier 'meta
  ;;       mac-option-modifier nil
  ;;       mac-use-title-bar nil)

  ;; Make sure clipboard works properly in tty mode on OSX
                                          ;(defun copy-from-osx ()
                                          ;(shell-command-to-string "pbpaste"))
                                          ;(defun paste-to-osx (text &optional push)
                                          ;(let ((process-connection-type nil))
                                          ;(let ((proc (start-process "pbcopy" "*Messages*" "pbcopy")))
                                          ;(process-send-string proc text)
                                          ;(process-send-eof proc))))
                                          ;(if (not (display-graphic-p))
                                          ;(progn (setq interprogram-cut-function 'paste-to-osx)
                                          ;(setq interprogram-paste-function 'copy-from-osx)))

  ;; y/n for  answering yes/no questions
  (fset 'yes-or-no-p 'y-or-n-p)
  ;; use ssh by default in tramp
  (setq tramp-default-method "ssh")

  ;; No tabs
  ;;(setq-default indent-tabs-mode nil)

  ;; Tab.space equivalence
  (setq tab-width 4)

  ;; Size of temporary buffers
  (temp-buffer-resize-mode)
  (setq temp-buffer-max-height 8)

  ;; Minimum window height
  (setq window-min-height 1)

  ;; Buffer encoding
  (prefer-coding-system       'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-language-environment   'utf-8)

  ;; Unique buffer names
  (require 'uniquify)
  (setq uniquify-buffer-name-style 'reverse
        uniquify-separator " • "
        uniquify-after-kill-buffer-p t
        uniquify-ignore-buffers-re "^\\*")

  ;; Default shell in term
  (setq-default shell-file-name "/bin/zsh")
  (setq explicit-shell-file-name "/bin/zsh")
  ;; activate eterm-256color-mode when starting term
  (add-hook 'term-mode-hook #'eterm-256color-mode)

  ;; Kill term buffer when exiting
  (defadvice term-sentinel (around my-advice-term-sentinel (proc msg))
    (if (memq (process-status proc) '(signal exit))
        (let ((buffer (process-buffer proc)))
          ad-do-it
          (kill-buffer buffer))
      ad-do-it))
  (ad-activate 'term-sentinel)

  ;; display line number in text/prog & fundamental modes
  (setq-default
   display-line-numbers-current-absolute t ;  Enable the line nubmers
   display-line-numbers-width 2
   display-line-numbers-widen t)
  (add-hook 'text-mode-hook #'display-line-numbers-mode)
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
  (add-hook 'fundamental-mode-hook #'display-line-numbers-mode)
#+end_src
** BACKUPS/SESSIONS ..etc
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/modules/SESSIONS.el
:header-args: :results none
:END:
#+begin_src emacs-lisp
  ;; Save miscellaneous history
  (setq savehist-additional-variables
        '(kill-ring
          command-history
          set-variable-value-history
          custom-variable-history   
          query-replace-history     
          read-expression-history   
          minibuffer-history        
          read-char-history         
          face-name-history         
          bookmark-history          
          ivy-history               
          counsel-M-x-history       
          file-name-history         
          counsel-minibuffer-history))
  (setq history-length 250)
  (setq kill-ring-max 25)
  (put 'minibuffer-history         'history-length 50)
  (put 'file-name-history          'history-length 50)
  (put 'set-variable-value-history 'history-length 25)
  (put 'custom-variable-history    'history-length 25)
  (put 'query-replace-history      'history-length 25)
  (put 'read-expression-history    'history-length 25)
  (put 'read-char-history          'history-length 25)
  (put 'face-name-history          'history-length 25)
  (put 'bookmark-history           'history-length 25)
  (put 'ivy-history                'history-length 25)
  (put 'counsel-M-x-history        'history-length 25)
  (put 'counsel-minibuffer-history 'history-length 25)
  (setq savehist-file "~/.local/share/emacs/savehist")
  (savehist-mode 1)

  ;; Remove text properties for kill ring entries
  ;; See https://emacs.stackexchange.com/questions/4187
  (defun unpropertize-kill-ring ()
    (setq kill-ring (mapcar 'substring-no-properties kill-ring)))
  (add-hook 'kill-emacs-hook 'unpropertize-kill-ring)

  ;; Recentf files 
  (setq recentf-max-menu-items 25)
  (setq recentf-save-file     "~/.local/share/emacs/recentf")
  (recentf-mode 1)

  ;; Bookmarks
  (setq bookmark-default-file "~/.local/share/emacs/bookmark")
  ;; Undo file
  (setq auto-save-file-name-transforms
        '((".*" "~/.local/share/emacs/undo/" t)))
  ;; Saving persistent tree-undo to a single directory
  (setq undo-tree-history-directory-alist     
        '(("." . "~/.local/share/emacs/undo-tree")))
  ;; Backup
  (setq backup-directory-alist '(("." . "~/.local/share/emacs/backups"))
        make-backup-files t     ; backup of a file the first time it is saved.
        backup-by-copying t     ; don't clobber symlinks
        version-control t       ; version numbers for backup files
        delete-old-versions t   ; delete excess backup files silently
        kept-old-versions 6     ; oldest versions to keep when a new numbered
                                          ;  backup is made (default: 2)
        kept-new-versions 9     ; newest versions to keep when a new numbered
                                          ;  backup is made (default: 2)
        auto-save-default t     ; auto-save every buffer that visits a file
        auto-save-timeout 20    ; number of seconds idle time before auto-save
                                          ;  (default: 30)
        auto-save-interval 200)  ; number of keystrokes between auto-saves
                                          ;  (default: 300)
  ;; Saving my sessions in another folder.
  (setq auto-save-list-file-prefix            
        "~/.local/share/emacs/sessions/session-")
  (setq auth-sources '("~/.local/share/emacs/authinfo"
                       "~/.local/share/emacs/authinfo.gpg"
                       "~/.authinfo"
                       "~/.authinfo.gpg"
                       "~/.netrc" ))
#+end_src

** BINDINGS              
:PROPERTIES:
:header-args: :tangle ~/.config/emacs/modules/BINDINGS.el
:header-args: :results none
:END:
*** Files
   #+begin_src emacs-lisp
     ;; some shortcuts -- files
     (global-set-key (kbd "C-c C") (lambda() (interactive)(find-file "~/.config/emacs/init.org")))
     (global-set-key (kbd "C-c b") (lambda() (interactive)(find-file "~/org/books.org")))
     (global-set-key (kbd "C-c I") (lambda() (interactive)(find-file "~/org/gtd/inbox.org")))
     (global-set-key (kbd "C-c L") (lambda() (interactive)(find-file "~/org/links.org")))
     (global-set-key (kbd "C-c E") (lambda() (interactive)(find-file "~/org/gtd/emails.org")))
     (global-set-key (kbd "<f12>") (lambda() (interactive)(find-file "~/org/conf/org.pdf")))
     ;; Reload buffer with <F5>
     (global-set-key [f5] '(lambda () (interactive) (revert-buffer nil t nil)))
   #+end_src
*** Win-movements
   #+begin_src emacs-lisp
     (global-set-key (kbd "<f12>" ) 'flyspell-auto-correct-previous-word)
     (defun zk/split-go-right()
       (interactive)
       (split-window-horizontally)
       (windmove-right))
     (defun zk/split-go-down()
       (interactive)
       (split-window-vertically)
       (windmove-down))
     ;; try to go to the other window automaticly
     (global-set-key (kbd "C-x i") 'zk/split-go-right)
     (global-set-key (kbd "C-x m") 'zk/split-go-down)

     ;; Move between buffer
     (global-set-key (kbd "M-n") 'switch-to-next-buffer)
     (global-set-key (kbd "M-p") 'switch-to-prev-buffer)

     ;; Move between Windows
     (global-set-key (kbd "C-x k") 'windmove-up)
     (global-set-key (kbd "C-x j") 'windmove-down)
     (global-set-key (kbd "C-x l") 'windmove-right)
     (global-set-key (kbd "C-x h") 'windmove-left)

     ;; Resize windows
     (global-set-key (kbd "C-M-l") 'shrink-window-horizontally)
     (global-set-key (kbd "C-M-h") 'enlarge-window-horizontally)
     (global-set-key (kbd "C-M-j") 'shrink-window)
     (global-set-key (kbd "C-M-k") 'enlarge-window)

     (global-set-key (kbd "M-o") 'delete-other-windows)
     (global-set-key (kbd "C-x p") 'zk/org-agenda-process-inbox-item)
   #+end_src

* PACKAGES             
  :PROPERTIES:
  :header-args: :tangle ~/.config/emacs/modules/PACKAGES.el
  :header-args: :results none
  :END:
** COMMENT Dired  
#+begin_src emacs-lisp
  (use-package dired-single)
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-gho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-find-file))

#+end_src
